#!/usr/bin/env python
# populate the database with some meaningful data

import os
import django

os.environ.setdefault('DJANGO_SETTINGS_MODULE', 'guitarchords.settings')
django.setup()

from chords.models import Artist, Song


def add_artist(name):
    a = Artist.objects.get_or_create(name=name)[0]
    a.save()
    return a

def add_song(title, artist, content, video='', tabs=False):
    s = Song.objects.get_or_create(title=title, artist=artist)[0]
    s.content = content
    s.video = video
    s.tabs = tabs
    s.save()
    return s

def populate():
    artist_katsimixa = add_artist("Αδελφοί Κατσιμίχα")

    add_song(
        title="Ρίτα Ριτάκι",
        artist=artist_katsimixa,
        content="""
G          Em        C             D
Παλεύει το ποτάμι στη θάλασσα να βγει
Κι ο ποιητής γυρεύει τη μούσα του να βρει
Το κύμα ψάχνει να ’βρει την άκρη του γιαλού
G              Em
Κι εγώ γυρεύω εσένανε
Am          C          D           (A)
εσένανε που μ’ έστησες ξανά στο ραντεβού

G               Em          C            D
Έψαχνα να ’βρω το μπελά μου και τελικά τον βρήκα
    G         Em      Am           D
Και πήγα και αγάπησα ένα μωρό, τη Ρίτα
G        Em          Am            D
Ρίτα δεκαοχτώ χρονών κι εγώ σαράντα πέντε
G              Em       Am              D
Ρίτα εσύ ’σαι στην αρχή κι εγώ στο παραπέντε

G     Em   C          D
Ρίτα-Ριτάκι, κανένα δε φοβάσαι
G      Em   C          D
Ρίτα-Ριτάκι, τίποτα δε θυμάσαι
G      Em   Am         D
Ρίτα-Ριτάκι, απόψε πού κοιμάσαι

G                Em         C          D
Μου το ’χες πει πολλές φορές ότι δε μ’ αγαπούσες
  G         Em         Am      D
Συγγνώμη, δεν κατάλαβα ότι το εννοούσες
G             Em         C              D
Γι αυτό λοιπόν σε χαιρετώ και φεύγω δίχως λόγια
G            Em        C            D
Με το κεφάλι μου ψηλά και την ψυχή στα πόδια

G     Em   C          D
Ρίτα-Ριτάκι, κανένα δε φοβάσαι
G      Em   C          D
Ρίτα-Ριτάκι, τίποτα δε θυμάσαι
G      Em   Am         D
Ρίτα-Ριτάκι, απόψε πού κοιμάσαι
"""
            )

    artist_xasma = add_artist("Χάσμα")

    add_song(
        title="Δε με ελέγχω",
        artist=artist_xasma,
        content="""
                   Bm               D
Κάνουν το λάθος το απλό, μα και σωστό
                    Em
και μ' έχουν στο ξωπίσω
                    Bm                D
με λένε γιο της μοναξιάς γιατί είμαι εδώ
             G
χωρίς να φταίω εγώ
                          Bm               D
και μου ξορκίζουν τις στιγμές μ' αγνές ευχές
                 Em
μπροστά να προχωρήσω
                       G
μα εγώ το ξέρω πως θα ζήσω
             A
μόνο σαν κακή στιγμή σε κόλπο ομαδικό

Bm           D                     Em
Κι όλοι γελούν όταν το στόμα μου ανοίξω
                   Bm
μου χαρακώνουν το χτες
                D                      G
φωτεινές επιγραφές που δείχνουν το σωστό
                          Bm                  D
γιατί είσαι κι εσύ κάθε φορά που φεύγεις μακριά
                  Em
και για να σ' αγαπήσω
                             G
πρέπει απ' την αρχή να ξαναρχίσω
                    A
μα φταίει μόνο που δε με ελέγχω
Bm            Em             A      Em
δε με ελέγχω, δε με ελέγχω, δε με ελέγχω

    Bm
Και τρέχω - χάνομαι - μπλέκω σε γιορτή
ανησυχώ - ζαλίζομαι - γίνομαι κελί
κάθε στιγμή που αφήνομαι να σε κοιτώ απλά
        G
σα ναυαγός ξεβράζομαι μες τη μοναξιά

Bm
Τρέχω - χάνομαι - μπλέκω σε γιορτή
ανησυχώ - ζαλίζομαι - γίνομαι κελί
κάθε στιγμή που αφήνομαι να σε κοιτώ απλά
        G
δε με ελέγχω - χάνομαι - γίνομαι σκιά

        Bm
Δε με ελέγχω - μπλέκω σε γιορτή
        D
δε με ελέγχω - γίνομαι κελί
        A
δε με ελέγχω - να σε κοιτώ απλά
        G
δε με ελέγχω - χάνομαι - γίνομαι σκιά
"""
            )

    add_song(
        title="Ό,τι αγαπώ είναι για λίγο",
        artist=artist_xasma,
        content="""
F#5       A5               D5
Κάθε μου λέξη σε κρυμμένη σελίδα
     E5                       D5       E5
για εκείνο το πρωί που έμεινα μόνος να σκεφτώ
F#5              A5                         D5
και για το μυστικό μέσα στα μάτια σου που είδα
    B5                       C#5             E5
πως πίσω απ' τη γιορτή είσαι μαρτύριο και καταιγίδα

F#5              A5                    D5
Τώρα πως να στο δείξω ότι την ώρα που φεύγεις
     E5                      D5       E5
με εκείνους που λυπάμαι μου ζητάς να αγαπηθώ
F#5           A5                      D5
κι όσο είναι αρκετό που εύκολο δρόμο διαλέγεις
   B5                  C#5         E5             D5
αυτή η ανταμοιβή με φυλακίζει και πιέζει να δεχτώ
                  E5                        F#5
κάθε φτηνή περιγραφή αυτών που θα 'θελα να ζω
D5                    E5                A5
πάντα σ’ αγγίζω λίγο μέχρι να αρχίσω να πετώ

        C#5             D5
Μα ότι αγαπώ είναι για λίγο
         E5                   A5
για λίγο χάνομαι κι αρχίζω να πετώ
    C#5             D5
Ότι αγαπώ είναι για λίγο
         E5                     F#5
για λίγο χάνομαι κι αρχίζω να πετώ

F#5       A5                     D5
Γράψε μου λόγια από τα λόγια που ξέρεις
  E5                        D5          E5
κουβέντες που με βία αποστηθίζεις και θυμό
F#5     A5                      D5
Όσο πολλούς κι αν γύρω σου καταφέρεις
     B5                        C#5          E5
γι' αγάπη όταν μιλάς μέσα σου καίγεσαι και υποφέρεις

F#5         A5               D5
Κι έτσι τα βράδια αποζητάς προστασία
    E5                  D5       E5
σε μπαρ κοσμοπολίτικα ψαρεύεις σεβασμό
F#5       A5               D5
Ξέρεις, εκεί δε ζητιανεύω αξία
    B5                     C#5                   E5       D5
Θα μείνω απ' αυτούς στις γειτονιές που σπέρνουν άγριο χορό
                    E5                       F#5
Γράψε για μένα αποστροφή κι ένα κλουβί σαν φυλαχτό
D5                  E5                 A5
μέσα να μπαίνω λίγο μέχρι να αρχίσω να πετώ

Μα ότι αγαπώ είναι για λίγο...

<em>Κλείσιμο</em>
F#5 E5 D5
"""
            )

    # print out what we have added to the user
    for a in Artist.objects.all():
        for s in Song.objects.filter(artist=a):
            print('{0} - {1}'.format(str(a), str(s)))


if __name__ == '__main__':
    print("starting chords population script...\n")
    populate()
